export const textInputTypes = {
  text: "text",
  number: "number",
  textarea: "textarea",
};

export const helpKeys = {
  id: "id",
  name: "name",
  details: "details",
  phone: "phone",
  lat: "lat",
  lon: "lon",
  views: "views",
  isTest: "isTest",
  victim_ip: "victim_ip",
  victim_email: "victim_email",
  added_at: "added_at",
};

export function makeQueryStringUrl(url, obj) {
  const keyValuePairs = [];
  for (const key in obj) {
    keyValuePairs.push(
      encodeURIComponent(key) + "=" + encodeURIComponent(obj[key])
    );
  }
  const fullUrl = url + "?" + keyValuePairs.join("&");

  return fullUrl;
}

export function haversineDistance(lat1, lon1, lat2, lon2) {
  const R = 6371; // Radius of the Earth in kilometers
  const dLat = ((lat2 - lat1) * Math.PI) / 180;
  const dLon = ((lon2 - lon1) * Math.PI) / 180;
  const a =
    Math.sin(dLat / 2) * Math.sin(dLat / 2) +
    Math.cos((lat1 * Math.PI) / 180) *
      Math.cos((lat2 * Math.PI) / 180) *
      Math.sin(dLon / 2) *
      Math.sin(dLon / 2);
  const c = 2 * Math.atan2(Math.sqrt(a), Math.sqrt(1 - a));
  const distance = R * c;
  return distance;
}

export const armyNumber = {
  "ঢাকা মহানগর": {
    লালবাগ: ["০১৭৬৯০৫১৮৩৮", "০১৭৬৯০৫১৮৩৯"],
    ধানমন্ডি: ["০১৭৬৯০৫১৮৩৮", "০১৭৬৯০৫১৮৩৯"],
    মোহাম্মদপুর: ["০১৭৬৯০৫১৮৩৮", "০১৭৬৯০৫১৮৩৯"],
    শ্যামলী: ["০১৭৬৯০৫১৮৩৮", "০১৭৬৯০৫১৮৩৯"],
    আগারগাঁও: ["০১৭৬৯০৫১৮৩৮", "০১৭৬৯০৫১৮৩৯"],
    মহাখালী: ["০১৭৬৯০৫১৮৩৮", "০১৭৬৯০৫১৮৩৯"],
    তেজগাঁও: ["০১৭৬৯০৫১৮৩৮", "০১৭৬৯০৫১৮৩৯"],
    "এলিফেন্ট রোড": ["০১৭৬৯০৫১৮৩৮", "০১৭৬৯০৫১৮৩৯"],
    কাঁটাবন: ["০১৭৬৯০৫১৮৩৮", "০১৭৬৯০৫১৮৩৯"],
    গুলশান: ["০১৭৬৯০১৩১০২", "০১৭৬৯০৫৩১৫৪"],
    বারিধারা: ["০১৭৬৯০১৩১০২", "০১৭৬৯০৫৩১৫৪"],
    বনানী: ["০১৭৬৯০১৩১০২", "০১৭৬৯০৫৩১৫৪"],
    বসুন্ধরা: ["০১৭৬৯০১৩১০২", "০১৭৬৯০৫৩১৫৪"],
    বাড্ডা: ["০১৭৬৯০১৩১০২", "০১৭৬৯০৫৩১৫৪"],
    রামপুরা: ["০১৭৬৯০১৩১০২", "০১৭৬৯০৫৩১৫৪"],
    শাহজাহানপুর: ["০১৭৬৯০১৩১০২", "০১৭৬৯০৫৩১৫৪"],
    উত্তরখান: ["০১৭৬৯০১৩১০২", "০১৭৬৯০৫৩১৫৪"],
    দক্ষিণখান: ["০১৭৬৯০১৩১০২", "০১৭৬৯০৫৩১৫৪"],
    বনশ্রী: ["০১৭৬৯০১৩১০২", "০১৭৬৯০৫৩১৫৪"],
    "মিরপুর ১-১৪": ["০১৭৬৯০২৪২১০", "০১৭৬৯০২৪২১১"],
    খিলক্ষেত: ["০১৭৬৯০২৪২১০", "০১৭৬৯০২৪২১১"],
    উত্তরা: ["০১৭৬৯০২৪২১০", "০১৭৬৯০২৪২১১"],
    "শাহাজালাল আন্তর্জাতিক বিমান বন্দর": ["০১৭৬৯০২৪২১০", "০১৭৬৯০২৪২১১"],
    মতিঝিল: ["০১৭৬৯০৯২৪২৮", "০১৭৬৯০৯৫৪১৯"],
    সেগুনবাগিচা: ["০১৭৬৯০৯২৪২৮", "০১৭৬৯০৯৫৪১৯"],
    কাকরাইল: ["০১৭৬৯০৯২৪২৮", "০১৭৬৯০৯৫৪১৯"],
    শান্তিনগর: ["০১৭৬৯০৯২৪২৮", "০১৭৬৯০৯৫৪১৯"],
    ইস্কাটন: ["০১৭৬৯০৯২৪২৮", "০১৭৬৯০৯৫৪১৯"],
    রাজারবাগ: ["০১৭৬৯০৯২৪২৮", "০১৭৬৯০৯৫৪১৯"],
    পল্টন: ["০১৭৬৯০৯২৪২৮", "০১৭৬৯০৯৫৪১৯"],
    গুলিস্থান: ["০১৭৬৯০৯২৪২৮", "০১৭৬৯০৯৫৪১৯"],
    "পুরান ঢাকা": ["০১৭৬৯০৯২৪২৮", "০১৭৬৯০৯৫৪১৯"],
  },
  "ঢাকা পার্শ্ববর্তি": {
    মাদারীপুর: ["০১৭৬৯০৭২১০২", "০১৭৬৯০৭২১০৩"],
    কিশোরগঞ্জ: ["০১৭৬৯১৯২৩৮২", "০১৭৬৯২০২৩৬৬"],
    টাঙ্গাইল: ["০১৭৬৯২১২৬৫১", "০১৭৬৯২১০৮৭০"],
    গোপালগঞ্জ: ["০১৭৬৯৫৫২৪৩৬", "০১৭৬৯৫৫২৪৪৮"],
    রাজবাড়ী: ["০১৭৬৯৫৫২৫১৪", "০১৭৬৯৫৫২৫২৮"],
    গাজীপুর: ["০১৭৮৫৩৪৯৮৪২", "০১৭৬৯০৯২১০৬"],
    মুন্সিগঞ্জ: ["০১৭৬৯০৮২৭৯৮", "০১৭৬৯০৮২৭৮৪"],
    মানিকগঞ্জ: ["০১৭৬৯০৯২৫৪০", "০১৭৬৯০৯২৫৪২"],
    নারায়ণগঞ্জ: ["০১৭৩২০৫১৮৫৮"],
    নরসিংদী: ["০১৭৬৯০৮২৭৬৬", "০১৭৬৯০৮২৭৭৮"],
    শরিয়তপুর: ["০১৭৬৯০৯৭৬৬০", "০১৭৬৯০৯৭৬৫৫"],
    ফরিদপুর: ["০১৭৬৯০৯২১০২", "০১৭৪২৯৬৬১৬২"],
  },
  বরিশাল: {
    বরিশাল: ["০১৭৬৯০৭২৫৫৬"],
    পটুয়াখালী: ["০১৭৬৯০৭৩১২০", "০১৭৬৯০৭৩১২২"],
    ঝালকাঠি: ["০১৭৬৯০৭২১০৮", "০১৭৬৯০৭২১২২"],
    পিরোজপুর: ["০১৭৬৯০৭৮২৯৮", "০১৭৬৯০৭৮৩০৮"],
  },
  চট্টগ্রাম: {
    নোয়াখালী: ["০১৬৪৪৪৬৬০৫১", "০১৭২৫০৩৮৬৭৭"],
    চাঁদপুর: ["০১৮১৫৪৪০৫৪৩", "০১৫৬৮৭৩৪৯৭৬"],
    ফেনী: ["০১৭৬৯৩৩৫৪৬১", "০১৭৬৯৩৩৫৪৩৪"],
    লক্ষীপুর: ["০১৭২১৮২১০৯৬", "০১৭০৮৭৬২১১০"],
    কুমিল্লা: ["০১৩৩৪৬১৬১৫৯", "০১৩৩৪৬১৬১৬০"],
    ব্রাক্ষণবাড়িয়া: ["০১৭৬৯৩২২৪৯১", "০১৭৬৯৩৩২৬০৯"],
    কক্সবাজার: ["০১৭৬৯১০৭২৩১", "০১৭৬৯১০৭২৩২"],
    লোহাগড়া: ["০১৭৬৯১০৭২৩১", "০১৭৬৯১০৭২৩২"],
    পটিয়া: ["০১৭৬৯১০৭২৩১", "০১৭৬৯১০৭২৩২"],
    চন্দনাইশ: ["০১৭৬৯১০৭২৩১", "০১৭৬৯১০৭২৩২"],
    বাঁশখালী: ["০১৭৬৯১০৭২৩১", "০১৭৬৯১০৭২৩২"],
    সাতকানিয়া: ["০১৭৬৯১০৭২৩১", "০১৭৬৯১০৭২৩২"],
    চট্টগ্রাম: ["০১৭৬৯২৪২০১২", "০১৭৬৯২৪২০১৪"],
  },

  ময়মনসিংহ: {
    শেরপুর: ["০১৭৬৯২০২৫১৬", "০১৭৬৯২০২৫২৪"],
    নেত্রকোণা: ["০১৭৬৯২০২৪৭৮", "০১৭৬৯২০২৪৪৮"],
    জামালপুর: ["০১৭৬৯১৯২৫৪৫", "০১৭৬৯১৯২৫৫০"],
    ময়মনসিংহ: ["০১৭৬৯২০৮১৫১", "০১৭৬৯২০৮১৬৫"],
  },

  খুলনা: {
    বাগেরহাট: ["০১৭৬৯০৭২৫১৪", "০১৭৬৯০৭২৫৩৬"],
    কুষ্টিয়া: ["০১৭৬৯৫৫২৩৬২", "০১৭৬৯৫৫২৩৬৬"],
    চুয়াডাঙ্গা: ["০১৭৬৯৫৫২৩৮০", "০১৭৬৯৫৫২৩৮২"],
    মেহেরপুর: ["০১৭৬৯৫৫২৩৯৮", "০২৪৭৯৯২১১৫৩"],
    নড়াইল: ["০১৭৬৯৫৫২৪৫৬", "০১৭৬৯৫৫২৪৫৭"],
    মাগুরা: ["০১৭৬৯৫৫৪৫০৫", "০১৭৬৯৫৫৪৫০৬"],
    ঝিনাইদহ: ["০১৭৬৯৫৫২১৫৮", "০১৭৬৯৫৫২১৭২"],
    যশোর: ["০১৭৬৯৫৫২৬১০", "০১৭৬৯০০৯২৪৫"],
    খুলনা: ["০১৭৬৯৫৫২৬১৬", "০১৭৬৯৫৫২৬১৮"],
    সাতক্ষীরা: ["০১৭৬৯৫৫২৫৩৬", "০১৭৬৯৫৫২৫৪৮"],
  },

  রাজশাহী: {
    রাজশাহী: ["০১৭৬৯১১২৩৮৬", "০১৭৬৯১১২৩৮৮"],
    চাঁপাইনবাবগঞ্জ: ["০১৭৬৯১১২০৭০", "০১৭৬৯১১২৩৭২"],
    পাবনা: ["০১৭৬৯১২২৪৭৮", "০১৭৬৯১১২৪৮০"],
    সিরাজগঞ্জ: ["০১৭৬৯১২২৪৬২", "০১৭৬৯১২২২৬৪"],
    নাটোর: ["০১৭৬৯১১২৪৪৬", "০১৭৬৯১১২৪৪৮"],
    নওগাঁ: ["০১৭৬৯১২২১১৫", "০১৭৬৯১২২১০৮"],
    জয়পুরহাট: ["০১৭৬৯১১২৬৩৪"],
    বগুড়া: ["১৭৬৯১১২৫৯৪", "০১৭৬৯১১২১৭০"],
  },

  রংপুর: {
    রংপুর: ["০১৭৬৯৬৬২৫৫৪", "০১৭৬৯৬৬২৫১৬"],
    দিনাজপুর: ["০২৫৮৯৯২১৪০০", "০২৫৮৯৬৮২৪১৪"],
    নীলফামারী: ["০১৭৬৯৬৮২৫০২", "০১৭৬৯৬৮২৫১২"],
    লালমনিরহাট: ["০১৭৬৯৬৮২৩৬৬", "০১৭৬৯৬৮২৩৬২"],
    কুড়িগ্রাম: ["০১৭৬৯৬৬২৫৩৪", "০১৭৬৯৬৬২৫৩৬"],
    ঠাকুরগাঁউ: ["০১৭৬৯৬৬৬০৬২", "০১৭৬৯৬৭২৬১৬"],
    পঞ্চগড়: ["০১৯৭৩০০০৬৬২", "০১৭৬৯৬৬২৬৬১"],
    গাইবান্ধা: ["০১৬১০৬৫২৫২৫", "০১৭৫৪৫৮৫৪৮৬"],
  },

  সিলেট: {
    সিলেট: ["০১৭৬৯১৭৭২৬৮", "০১৯৮৭৮৩৩৩০১"],
    হবিগঞ্জ: ["০১৭৬৯১৭২৫৯৬", "০১৭৬৯১৭২৬১৬"],
    সুনামগঞ্জ: ["০১৭৬৯১৭২৪২০", "০১৭৬৯১৭২৪৩০"],
    মৌলভীবাজার: ["০১৭৬৯১৭৫৬৮০", "০১৭৬৯১৭২৪০০"],
  },
};

const numMap = {
  "০": "0",
  "১": "1",
  "২": "2",
  "৩": "3",
  "৪": "4",
  "৫": "5",
  "৬": "6",
  "৭": "7",
  "৮": "8",
  "৯": "9",
};

export const convertNumbersToEnglish = (numberStr) => {
  if (!numberStr) return "";
  const convertedNum = numberStr
    .split("")
    .map((num) => numMap[num])
    .join("");

  return convertedNum;
};

export const getGoogleAuthURL = () => {
  if (typeof window === "undefined") return "";

  const clientId =
    "985996704788-ru0frja1q6nh29bqifr7ibsgmavj1ka1.apps.googleusercontent.com";

  //   const clientIdReq = await fetch(apiUrls.api_client_id);
  //   const clientIdRes = await clientIdReq.json();

  //   const clientId = clientIdRes.data;

  const hostname = window.location.origin;

  const redirectUri = makeQueryStringUrl(hostname + "/api/auth/callback", {
    provider: "google",
    // inviteKey: token || "",
  });

  const scope = "openid email profile";

  const authUrl =
    `https://accounts.google.com/o/oauth2/auth?` +
    `client_id=${clientId}&redirect_uri=${redirectUri}&response_type=code` +
    `&scope=${scope}`;

  return authUrl;
};
